IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_G1_EPWM15_CONTROLSS_G1_EPWM15.xml
	<register id="CONTROLSS_G1_EPWM15_TZFRC" acronym="CONTROLSS_G1_EPWM15_TZFRC" offset="0x136" width="16" description="Trip Zone Force Register">
		<bitfield id="CAPEVT" width="1" begin="7" end="7" resetval="0x0" description="Force Flag for Capture Event Output   0: Writing 0 has no effect. This bit always reads back 0.  1: Writing 1 forces the CAPEVT event trip condition and sets the TZFLG[CAPEVT] bit." range="7" rwaccess="R/W1TS"/> 
		<bitfield id="DCBEVT2" width="1" begin="6" end="6" resetval="0x0" description="Force Flag for Digital Compare Output B Event 2   0: Writing 0 has no effect. This bit always reads back 0.  1: Writing 1 forces the DCBEVT2 event trip condition and sets the TZFLG[DCBEVT2] bit." range="6" rwaccess="R/W1TS"/> 
		<bitfield id="DCBEVT1" width="1" begin="5" end="5" resetval="0x0" description="Force Flag for Digital Compare Output B Event 1   0: Writing 0 has no effect. This bit always reads back 0.  1: Writing 1 forces the DCBEVT1 event trip condition and sets the TZFLG[DCBEVT1] bit." range="5" rwaccess="R/W1TS"/> 
		<bitfield id="DCAEVT2" width="1" begin="4" end="4" resetval="0x0" description="Force Flag for Digital Compare Output A Event 2   0: Writing 0 has no effect. This bit always reads back 0.  1: Writing 1 forces the DCAEVT2 event trip condition and sets the TZFLG[DCAEVT2] bit." range="4" rwaccess="R/W1TS"/> 
		<bitfield id="DCAEVT1" width="1" begin="3" end="3" resetval="0x0" description="Force Flag for Digital Compare Output A Event 1   0: Writing 0 has no effect. This bit always reads back 0  1: Writing 1 forces the DCAEVT1 event trip condition and sets the TZFLG[DCAEVT1] bit." range="3" rwaccess="R/W1TS"/> 
		<bitfield id="OST" width="1" begin="2" end="2" resetval="0x0" description="Force a One-Shot Trip Event via Software   0: Writing of 0 is ignored. Always reads back a 0.  1: Forces a one-shot trip event and sets the TZFLG[OST] bit." range="2" rwaccess="R/W1TS"/> 
		<bitfield id="CBC" width="1" begin="1" end="1" resetval="0x0" description="Force a Cycle-by-Cycle Trip Event via Software   0: Writing of 0 is ignored. Always reads back a 0.  1: Forces a cycle-by-cycle trip event and sets the TZFLG[CBC] bit." range="1" rwaccess="R/W1TS"/>
	</register>
	<register id="CONTROLSS_G1_EPWM15_TZTRIPOUTSEL" acronym="CONTROLSS_G1_EPWM15_TZTRIPOUTSEL" offset="0x13A" width="16" description="Trip Zone Force Register">
		<bitfield id="CAPEVT" width="1" begin="12" end="12" resetval="0x0" description="CAPEVT Select   0: Disable TZ6 as a TRIPOUT source for this ePWM module  1: Enable TZ6 as a TRIPOUT source for this ePWM module" range="12" rwaccess="R/W"/> 
		<bitfield id="DCBEVT2" width="1" begin="11" end="11" resetval="0x0" description="DCBEVT2 Select   0: Disable TZ6 as a TRIPOUT source for this ePWM module  1: Enable TZ6 as a TRIPOUT source for this ePWM module" range="11" rwaccess="R/W"/> 
		<bitfield id="DCBEVT1" width="1" begin="10" end="10" resetval="0x0" description="DCBEVT1 Select   0: Disable TZ6 as a TRIPOUT source for this ePWM module  1: Enable TZ6 as a TRIPOUT source for this ePWM module" range="10" rwaccess="R/W"/> 
		<bitfield id="DCAEVT2" width="1" begin="9" end="9" resetval="0x0" description="DCAEVT2 Select   0: Disable TZ6 as a TRIPOUT source for this ePWM module  1: Enable TZ6 as a TRIPOUT source for this ePWM module" range="9" rwaccess="R/W"/> 
		<bitfield id="DCAEVT1" width="1" begin="8" end="8" resetval="0x0" description="DCAEVT1 Select   0: Disable TZ6 as a TRIPOUT source for this ePWM module  1: Enable TZ6 as a TRIPOUT source for this ePWM module" range="8" rwaccess="R/W"/> 
		<bitfield id="TZ6" width="1" begin="7" end="7" resetval="0x0" description="Trip-zone 6 [TZ6] Select   0: Disable TZ6 as a TRIPOUT source for this ePWM module  1: Enable TZ6 as a TRIPOUT source for this ePWM module" range="7" rwaccess="R/W"/> 
		<bitfield id="TZ5" width="1" begin="6" end="6" resetval="0x0" description="Trip-zone 5 [TZ5] Select   0: Disable TZ5 as a TRIPOUT source for this ePWM module  1: Enable TZ5 as a TRIPOUT source for this ePWM module" range="6" rwaccess="R/W"/> 
		<bitfield id="TZ4" width="1" begin="5" end="5" resetval="0x0" description="Trip-zone 4 [TZ4] Select   0: Disable TZ4 as a TRIPOUT source for this ePWM module  1: Enable TZ4 as a TRIPOUT source for this ePWM module" range="5" rwaccess="R/W"/> 
		<bitfield id="TZ3" width="1" begin="4" end="4" resetval="0x0" description="Trip-zone 3 [TZ3] Select   0: Disable TZ3 as a TRIPOUT source for this ePWM module  1: Enable TZ3 as a TRIPOUT source for this ePWM module" range="4" rwaccess="R/W"/> 
		<bitfield id="TZ2" width="1" begin="3" end="3" resetval="0x0" description="Trip-zone 2 [TZ2] Select   0: Disable TZ2 as a TRIPOUT source for this ePWM module  1: Enable TZ2 as a TRIPOUT source for this ePWM module" range="3" rwaccess="R/W"/> 
		<bitfield id="TZ1" width="1" begin="2" end="2" resetval="0x0" description="Trip-zone 1 [TZ1] Select   0: Disable TZ1 as a TRIPOUT source for this ePWM module  1: Enable TZ1 as a TRIPOUT source for this ePWM module" range="2" rwaccess="R/W"/> 
		<bitfield id="CBC" width="1" begin="1" end="1" resetval="0x0" description="CBC  Select   0: Disable TZ1 as a TRIPOUT source for this ePWM module  1: Enable TZ1 as a TRIPOUT source for this ePWM module" range="1" rwaccess="R/W"/> 
		<bitfield id="OST" width="1" begin="0" end="0" resetval="0x0" description="OST Select   0: Disable TZ1 as a TRIPOUT source for this ePWM module  1: Enable TZ1 as a TRIPOUT source for this ePWM module" range="0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G1_EPWM15_ETSEL" acronym="CONTROLSS_G1_EPWM15_ETSEL" offset="0x148" width="16" description="Event Trigger Selection Register">
		<bitfield id="SOCBEN" width="1" begin="15" end="15" resetval="0x0" description="Enable the ADC Start of Conversion B [EPWMxSOCB] Pulse   0: Disable EPWMxSOCB.  1: Enable EPWMxSOCB pulse." range="15" rwaccess="R/W"/> 
		<bitfield id="SOCBSEL" width="3" begin="14" end="12" resetval="0x0" description="EPWMxSOCB Selection Options  These bits determine when a EPWMxSOCB pulse will be generated.   000: Enable DCBEVT1.soc event  001: Enable event time-base counter equal to zero. [TBCTR = 0x00]  010: Enable event time-base counter equal to period [TBCTR = TBPRD]  011: Enable event time-base counter based on mixed events [ETSOCBMIX].  ETSOCBMIX is configured in the ETSOCBMIXEN register.   100: Enable event time-base counter equal to CMPA when the timer is incrementing or CMPC when the timer is incrementing  101: Enable event time-base counter equal to CMPA when the timer is decrementing or CMPC when the timer is decrementing  110: Enable event: time-base counter equal to CMPB when the timer is incrementing or CMPD when the timer is incrementing  111: Enable event: time-base counter equal to CMPB when the timer is decrementing or CMPD when the timer is decrementing [*] Event selected is determined by SOCBSELCMP bit." range="14 - 12" rwaccess="R/W"/> 
		<bitfield id="SOCAEN" width="1" begin="11" end="11" resetval="0x0" description="Enable the ADC Start of Conversion A [EPWMxSOCA] Pulse   0: Disable EPWMxSOCA.  1: Enable EPWMxSOCA pulse." range="11" rwaccess="R/W"/> 
		<bitfield id="SOCASEL" width="3" begin="10" end="8" resetval="0x0" description="EPWMxSOCA Selection Options  These bits determine when a EPWMxSOCA pulse will be generated.   000: Enable DCAEVT1.soc event  001: Enable event time-base counter equal to zero. [TBCTR = 0x00]  010: Enable event time-base counter equal to period [TBCTR = TBPRD]  011: Enable event time-base counter based on mixed events [ETSOCAMIX].  ETSOCAMIX is configured in the ETSOCAMIXEN register.   100: Enable event time-base counter equal to CMPA when the timer is incrementing or CMPC when the timer is incrementing  101: Enable event time-base counter equal to CMPA when the timer is decrementing or CMPC when the timer is decrementing  110: Enable event: time-base counter equal to CMPB when the timer is incrementing or CMPD when the timer is incrementing  111: Enable event: time-base counter equal to CMPB when the timer is decrementing or CMPD when the timer is decrementing [*] Event selected is determined by SOCASELCMP bit." range="10 - 8" rwaccess="R/W"/> 
		<bitfield id="INTSELCMP" width="1" begin="6" end="6" resetval="0x0" description="EPWMxINT Compare Register Selection Options   0: Enable event time-base counter equal to CMPA when the timer is incrementing / Enable event time-base counter equal to CMPA when the timer is decrementing / Enable event: time-base counter equal to CMPB when the timer is incrementing / Enable event: time-base counter equal to CMPB when the timer is decrementing to INTSEL selection mux.  1: Enable event time-base counter equal to CMPC when the timer is incrementing / Enable event time-base counter equal to CMPC when the timer is decrementing / Enable event: time-base counter equal to CMPD when the timer is incrementing / Enable event: time-base counter equal to CMPD when the timer is decrementing to INTSEL selection mux." range="6" rwaccess="R/W"/> 
		<bitfield id="SOCBSELCMP" width="1" begin="5" end="5" resetval="0x0" description="EPWMxSOCB Compare Register Selection Options   0: Enable event time-base counter equal to CMPA when the timer is incrementing / Enable event time-base counter equal to CMPA when the timer is decrementing / Enable event: time-base counter equal to CMPB when the timer is incrementing / Enable event: time-base counter equal to CMPB when the timer is decrementing to SOCBSEL selection mux.  1: Enable event time-base counter equal to CMPC when the timer is incrementing / Enable event time-base counter equal to CMPC when the timer is decrementing / Enable event: time-base counter equal to CMPD when the timer is incrementing / Enable event: time-base counter equal to CMPD when the timer is decrementing to SOCBSEL selection mux." range="5" rwaccess="R/W"/> 
		<bitfield id="SOCASELCMP" width="1" begin="4" end="4" resetval="0x0" description="EPWMxSOCA Compare Register Selection Options   0: Enable event time-base counter equal to CMPA when the timer is incrementing / Enable event time-base counter equal to CMPA when the timer is decrementing / Enable event: time-base counter equal to CMPB when the timer is incrementing / Enable event: time-base counter equal to CMPB when the timer is decrementing to SOCASEL selection mux.  1: Enable event time-base counter equal to CMPC when the timer is incrementing / Enable event time-base counter equal to CMPC when the timer is decrementing / Enable event: time-base counter equal to CMPD when the timer is incrementing / Enable event: time-base counter equal to CMPD when the timer is decrementing to SOCASEL selection mux." range="4" rwaccess="R/W"/> 
		<bitfield id="INTEN" width="1" begin="3" end="3" resetval="0x0" description="Enable ePWM Interrupt [EPWMx_INT] Generation   0: Disable EPWMx_INT generation  1: Enable EPWMx_INT generation" range="3" rwaccess="R/W"/> 
		<bitfield id="INTSEL" width="3" begin="2" end="0" resetval="0x0" description="ePWM Interrupt [EPWMx_INT] Selection Options   000: Reserved  001: Enable event time-base counter equal to zero. [TBCTR = 0x00]  010: Enable event time-base counter equal to period [TBCTR = TBPRD]  011: Enable event time-base counter based on mixed events [ETINTMIX].  ETINTMIX is configured in the ETINTMIXEN register.   100: Enable event time-base counter equal to CMPA when the timer is incrementing or CMPC when the timer is incrementing  101: Enable event time-base counter equal to CMPA when the timer is decrementing or CMPC when the timer is decrementing  110: Enable event: time-base counter equal to CMPB when the timer is incrementing or CMPD when the timer is incrementing  111: Enable event: time-base counter equal to CMPB when the timer is decrementing or CMPD when the timer is decrementing [*] Event selected is determined by INTSELCMP bit." range="2 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G1_EPWM15_ETPS" acronym="CONTROLSS_G1_EPWM15_ETPS" offset="0x14C" width="16" description="Event Trigger Pre-Scale Register">
		<bitfield id="SOCBCNT" width="2" begin="15" end="14" resetval="0x0" description="ePWM ADC Start-of-Conversion B Event [EPWMxSOCB] Counter Register  These bits indicate how many selected ETSEL[SOCBSEL] events have occurred:   00: No events have occurred.  01: 1 event has occurred.  10: 2 events have occurred.  11: 3 events have occurred." range="15 - 14" rwaccess="R"/> 
		<bitfield id="SOCBPRD" width="2" begin="13" end="12" resetval="0x0" description="ePWM ADC Start-of-Conversion B Event [EPWMxSOCB] Period Select  These bits determine how many selected ETSEL[SOCBSEL] events need to occur before an EPWMxSOCB pulse is generated. To be generated, the pulse must be enabled [ETSEL[SOCBEN] = 1]. The SOCB pulse will be generated even if the status flag is set from a previous start of conversion [ETFLG[SOCB] = 1]. Once the SOCB pulse is generated, the ETPS[SOCBCNT] bits will automatically be cleared.   00: Disable the SOCB event counter. No EPWMxSOCB pulse will be generated  01: Generate the EPWMxSOCB pulse on the first event: ETPS[SOCBCNT] = 0,1  10: Generate the EPWMxSOCB pulse on the second event: ETPS[SOCBCNT] = 1,0  11: Generate the EPWMxSOCB pulse on the third event: ETPS[SOCBCNT] = 1,1" range="13 - 12" rwaccess="R/W"/> 
		<bitfield id="SOCACNT" width="2" begin="11" end="10" resetval="0x0" description="ePWM ADC Start-of-Conversion A Event [EPWMxSOCA] Counter Register  These bits indicate how many selected ETSEL[SOCASEL] events have occurred:   00: No events have occurred.  01: 1 event has occurred.  10: 2 events have occurred.  11: 3 events have occurred." range="11 - 10" rwaccess="R"/> 
		<bitfield id="SOCAPRD" width="2" begin="9" end="8" resetval="0x0" description="ePWM ADC Start-of-Conversion A Event [EPWMxSOCA] Period Select  These bits determine how many selected ETSEL[SOCASEL] events need to occur before an EPWMxSOCA pulse is generated. To be generated, the pulse must be enabled [ETSEL[SOCAEN] = 1]. The SOCA pulse will be generated even if the status flag is set from a previous start of conversion [ETFLG[SOCA] = 1]. Once the SOCA pulse is generated, the ETPS[SOCACNT] bits will automatically be cleared.   00: Disable the SOCA event counter. No EPWMxSOCA pulse will be generated  01: Generate the EPWMxSOCA pulse on the first event: ETPS[SOCACNT] = 0,1  10: Generate the EPWMxSOCA pulse on the second event: ETPS[SOCACNT] = 1,0  11: Generate the EPWMxSOCA pulse on the third event: ETPS[SOCACNT] = 1,1" range="9 - 8" rwaccess="R/W"/> 
		<bitfield id="SOCPSSEL" width="1" begin="5" end="5" resetval="0x0" description="EPWMxSOC A/B Pre-Scale Selection Bits   0: Selects ETPS [SOCACNT/SOCBCNT] and [SOCAPRD/SOCBPRD] registers to determine frequency of events [interrupt once every 0-3 events].  1: Selects ETSOCPS [SOCACNT2/SOCBCNT2] and [SOCAPRD2/SOCBPRD2] registers to determine frequency of events [interrupt once every 0-15 events]." range="5" rwaccess="R/W"/> 
		<bitfield id="INTPSSEL" width="1" begin="4" end="4" resetval="0x0" description="EPWMxINTn Pre-Scale Selection Bits   0: Selects ETPS [INTCNT, and INTPRD] registers to determine frequency of events [interrupt once every 0-3 events].  1: Selects ETINTPS [ INTCNT2, and INTPRD2 ] registers to determine frequency of events [interrupt once every 0-15 events]." range="4" rwaccess="R/W"/> 
		<bitfield id="INTCNT" width="2" begin="3" end="2" resetval="0x0" description="ePWM Interrupt Event [EPWMx_INT] Counter Register  These bits indicate how many selected ETSEL[INTSEL] events have occurred. These bits are automatically cleared when an interrupt pulse is generated. If interrupts are disabled, ETSEL[INT] = 0 or the interrupt flag is set, ETFLG[INT] = 1, the counter will stop counting events when it reaches the period value ETPS[INTCNT] = ETPS[INTPRD].   00: No events have occurred.  01: 1 event has occurred.  10: 2 events have occurred.  11: 3 events have occurred." range="3 - 2" rwaccess="R"/> 
		<bitfield id="INTPRD" width="2" begin="1" end="0" resetval="0x0" description="ePWM Interrupt [EPWMx_INT] Period Select  These bits determine how many selected ETSEL[INTSEL] events need to occur before an interrupt is generated. To be generated, the interrupt must be enabled [ETSEL[INT] = 1]. If the interrupt status flag is set from a previous interrupt [ETFLG[INT] = 1] then no interrupt will be generated until the flag is cleared via the ETCLR[INT] bit. This allows for one interrupt to be pending while another is still being serviced. Once the interrupt is generated, the ETPS[INTCNT] bits will automatically be cleared.  Writing a INTPRD value that is the same as the current counter value will trigger an interrupt if it is enabled and the status flag is clear.  Writing a INTPRD value that is less than the current counter value will result in an undefined state. If a counter event occurs at the same instant as a new zero or non-zero INTPRD value is written, the counter is incremented.   00: Disable the interrupt event counter. No interrupt will be generated and ETFRC[INT] is ignored.  01: Generate an interrupt on the first event INTCNT = 01 [first event]  10: Generate interrupt on ETPS[INTCNT] = 1,0 [second event]  11: Generate interrupt on ETPS[INTCNT] = 1,1 [third event]" range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G1_EPWM15_ETFLG" acronym="CONTROLSS_G1_EPWM15_ETFLG" offset="0x150" width="16" description="Event Trigger Flag Register">
		<bitfield id="SOCB" width="1" begin="3" end="3" resetval="0x0" description="Latched ePWM ADC Start-of-Conversion A [EPWMxSOCB] Status Flag  Unlike the ETFLG[INT] flag, the EPWMxSOCB output will continue to pulse even if the flag bit is set.   0: Indicates no event occurred  1: Indicates that a start of conversion pulse was generated on EPWMxSOCB. The EPWMxSOCB output will continue to be generated even if the flag bit is set." range="3" rwaccess="R"/> 
		<bitfield id="SOCA" width="1" begin="2" end="2" resetval="0x0" description="Latched ePWM ADC Start-of-Conversion A [EPWMxSOCA] Status Flag  Unlike the ETFLG[INT] flag, the EPWMxSOCA output will continue to pulse even if the flag bit is set.   0: Indicates no event occurred  1: Indicates that a start of conversion pulse was generated on EPWMxSOCA. The EPWMxSOCA output will continue to be generated even if the flag bit is set." range="2" rwaccess="R"/> 
		<bitfield id="INT" width="1" begin="0" end="0" resetval="0x0" description="Latched ePWM Interrupt [EPWMx_INT] Status Flag   0: Indicates no event occurred  1: Indicates that an ePWMx interrupt [EPWMx_INT] was generated. No further interrupts will be generated until the flag bit is cleared. Up to one interrupt can be pending while the ETFLG[INT] bit is still set. If an interrupt is pending, it will not be generated until after the ETFLG[INT] bit is cleared." range="0" rwaccess="R"/>
	</register>
	<register id="CONTROLSS_G1_EPWM15_ETCLR" acronym="CONTROLSS_G1_EPWM15_ETCLR" offset="0x154" width="16" description="Event Trigger Clear Register">
		<bitfield id="SOCB" width="1" begin="3" end="3" resetval="0x0" description="ePWM ADC Start-of-Conversion A [EPWMxSOCB] Flag Clear Bit   0: Writing a 0 has no effect. Always reads back a 0  1: Clears the ETFLG[SOCB] flag bit" range="3" rwaccess="R/W1TS"/> 
		<bitfield id="SOCA" width="1" begin="2" end="2" resetval="0x0" description="ePWM ADC Start-of-Conversion A [EPWMxSOCA] Flag Clear Bit   0: Writing a 0 has no effect. Always reads back a 0  1: Clears the ETFLG[SOCA] flag bit" range="2" rwaccess="R/W1TS"/> 
		<bitfield id="INT" width="1" begin="0" end="0" resetval="0x0" description="ePWM Interrupt [EPWMx_INT] Flag Clear Bit   0: Writing a 0 has no effect. Always reads back a 0  1: Clears the ETFLG[INT] flag bit and enable further interrupts pulses to be generated" range="0" rwaccess="R/W1TS"/>
	</register>
	<register id="CONTROLSS_G1_EPWM15_ETFRC" acronym="CONTROLSS_G1_EPWM15_ETFRC" offset="0x158" width="16" description="Event Trigger Force Register">
		<bitfield id="SOCB" width="1" begin="3" end="3" resetval="0x0" description="SOCB Force Bit  The SOCB pulse will only be generated if the event is enabled in the ETSEL register. The ETFLG[SOCB] flag bit will be set regardless.   0: Writing 0 to this bit will be ignored. Always reads back a 0.  1: Generates a pulse on EPWMxSOCB and set the SOCBFLG bit. This bit is used for test purposes." range="3" rwaccess="R/W1TS"/> 
		<bitfield id="SOCA" width="1" begin="2" end="2" resetval="0x0" description="SOCA Force Bit  The SOCA pulse will only be generated if the event is enabled in the ETSEL register. The ETFLG[SOCA] flag bit will be set regardless.   0: Writing 0 to this bit will be ignored. Always reads back a 0.  1: Generates a pulse on EPWMxSOCA and set the SOCAFLG bit. This bit is used for test purposes." range="2" rwaccess="R/W1TS"/> 
		<bitfield id="INT" width="1" begin="0" end="0" resetval="0x0" description="INT Force Bit  The interrupt will only be generated if the event is enabled in the ETSEL register. The INT flag bit will be set regardless.   0: Writing 0 to this bit will be ignored. Always reads back a 0.  1: Generates an interrupt on EPWMxINT and set the INT flag bit. This bit is used for test purposes." range="0" rwaccess="R/W1TS"/>
	</register>
	<register id="CONTROLSS_G1_EPWM15_ETINTPS" acronym="CONTROLSS_G1_EPWM15_ETINTPS" offset="0x15C" width="16" description="Event-Trigger Interrupt Pre-Scale Register">
		<bitfield id="INTCNT2" width="4" begin="7" end="4" resetval="0x0" description="EPWMxINT Counter 2  When ETPS[INTPSSEL]=1, these bits indicate how many selected events have occurred:   0000: No events  0001: 1 event  0010: 2 events  0011: 3 events  0100: 4 events  ...  1111: 15 events" range="7 - 4" rwaccess="R"/> 
		<bitfield id="INTPRD2" width="4" begin="3" end="0" resetval="0x0" description="EPWMxINT Period 2 Select  When ETPS[INTPSSEL] = 1, these bits select how many selected events need to occur before an interrupt is generated:   0000: Disable counter  0001: Generate interrupt on INTCNT = 1 [first event]  0010: Generate interrupt on INTCNT = 2 [second event]  0011: Generate interrupt on INTCNT = 3 [third event]  0100: Generate interrupt on INTCNT = 4 [fourth event]  ...  1111: Generate interrupt on INTCNT = 15 [fifteenth event]" range="3 - 0" rwaccess="R/W"/>
	</register>
